daas/esloadtestpostsearchsimulation30x1m-1482741411776/simulation.log
[INFO] Scanning for projects...
[WARNING] 
[WARNING] Some problems were encountered while building the effective model for com.datio.daas.testPF:testPF:jar:1.0-SNAPSHOT
[WARNING] 'build.plugins.plugin.(groupId:artifactId)' must be unique but found duplicate declaration of plugin net.alchim31.maven:scala-maven-plugin @ line 62, column 21
[WARNING] 'parent.relativePath' points at com.datio.daas:daas instead of com.stratio:parent, please verify your project structure @ line 24, column 13
[WARNING] 
[WARNING] It is highly recommended to fix these problems because they threaten the stability of your build.
[WARNING] 
[WARNING] For this reason, future Maven versions might no longer support building such malformed projects.
[WARNING] 
[INFO]                                                                         
[INFO] ------------------------------------------------------------------------
[INFO] Building testPF 1.0-SNAPSHOT
[INFO] ------------------------------------------------------------------------
[INFO] 
[INFO] --- maven-clean-plugin:2.5:clean (default-clean) @ testPF ---
[INFO] Deleting /home/david/workspace/daas/testPF/target
[INFO] 
[INFO] --- maven-resources-plugin:3.0.1:resources (default-resources) @ testPF ---
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] skip non existing resourceDirectory /home/david/workspace/daas/testPF/src/main/resources
[INFO] 
[INFO] --- scala-maven-plugin:3.2.2:add-source (scala-compile-first) @ testPF ---
[INFO] Add Source directory: /home/david/workspace/daas/testPF/src/main/scala
[INFO] Add Test Source directory: /home/david/workspace/daas/testPF/src/test/scala
[INFO] 
[INFO] --- scala-maven-plugin:3.2.2:compile (scala-compile-first) @ testPF ---
[WARNING]  Expected all dependencies to require Scala version: 2.11.6
[WARNING]  com.datio.daas.testPF:testPF:1.0-SNAPSHOT requires scala version: 2.11.6
[WARNING]  io.gatling.highcharts:gatling-charts-highcharts:2.1.7 requires scala version: 2.11.7
[WARNING] Multiple versions of scala libraries detected!
[INFO] No sources to compile
[INFO] 
[INFO] --- maven-resources-plugin:3.0.1:copy-resources (copy-resources) @ testPF ---
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] Copying 1 resource
[INFO] 
[INFO] --- maven-compiler-plugin:3.1:compile (default-compile) @ testPF ---
[INFO] No sources to compile
[INFO] 
[INFO] --- maven-resources-plugin:3.0.1:testResources (default-testResources) @ testPF ---
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] Copying 4 resources
[INFO] 
[INFO] --- scala-maven-plugin:3.2.2:testCompile (scala-test-compile) @ testPF ---
[WARNING]  Expected all dependencies to require Scala version: 2.11.6
[WARNING]  com.datio.daas.testPF:testPF:1.0-SNAPSHOT requires scala version: 2.11.6
[WARNING]  io.gatling.highcharts:gatling-charts-highcharts:2.1.7 requires scala version: 2.11.7
[WARNING] Multiple versions of scala libraries detected!
[INFO] /home/david/workspace/daas/testPF/src/test/scala:-1: info: compiling
[INFO] Compiling 22 source files to /home/david/workspace/daas/testPF/target/test-classes at 1482741310202
[INFO] prepare-compile in 0 s
[INFO] compile in 37 s
[INFO] 
[INFO] --- maven-compiler-plugin:3.1:testCompile (default-testCompile) @ testPF ---
[INFO] Nothing to compile - all classes are up to date
[INFO] 
[INFO] --- maven-surefire-plugin:2.7:test (default-test) @ testPF ---
[INFO] Tests are skipped.
[INFO] 
[INFO] --- maven-jar-plugin:2.4:jar (default-jar) @ testPF ---
[WARNING] JAR will be empty - no content was marked for inclusion!
[INFO] Building jar: /home/david/workspace/daas/testPF/target/testPF-1.0-SNAPSHOT.jar
[INFO] 
[INFO] --- gatling-maven-plugin:2.1.7:execute (default) @ testPF ---
Simulation com.datiobd.daas.testPF.simulations.EsLoadTestPostSearchSimulation30x1m started...
[WARN] [12/26/2016 09:36:45.884] [Base-Simulation-akka.actor.default-dispatcher-10] [akka.actor.ActorSystemImpl(Base-Simulation)] Explicitly set HTTP header 'Content-Type: application/json' is ignored, illegal RawHeader
[WARN] [12/26/2016 09:36:46.128] [Base-Simulation-akka.actor.default-dispatcher-9] [akka.actor.ActorSystemImpl(Base-Simulation)] Explicitly set HTTP header 'Content-Type: application/json' is ignored, illegal RawHeader
[WARN] [12/26/2016 09:36:46.224] [Base-Simulation-akka.actor.default-dispatcher-10] [akka.actor.ActorSystemImpl(Base-Simulation)] Explicitly set HTTP header 'Content-Type: application/json' is ignored, illegal RawHeader

================================================================================
2016-12-26 09:36:52                                           0s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[                                                                          ]  0%
          waiting: 30     / active: 0      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=0      KO=0     )

================================================================================


================================================================================
2016-12-26 09:36:56                                           5s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=1388   KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=1388   KO=0     )
================================================================================


================================================================================
2016-12-26 09:37:01                                          10s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=3669   KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=3669   KO=0     )
================================================================================


================================================================================
2016-12-26 09:37:06                                          15s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=5972   KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=5972   KO=0     )
================================================================================


================================================================================
2016-12-26 09:37:11                                          20s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=8266   KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=8266   KO=0     )
================================================================================


================================================================================
2016-12-26 09:37:16                                          25s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=10549  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=10549  KO=0     )
================================================================================


================================================================================
2016-12-26 09:37:21                                          30s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=12705  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=12705  KO=0     )
================================================================================


================================================================================
2016-12-26 09:37:26                                          35s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=15044  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=15044  KO=0     )
================================================================================


================================================================================
2016-12-26 09:37:31                                          40s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=17366  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=17366  KO=0     )
================================================================================


================================================================================
2016-12-26 09:37:36                                          45s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=19623  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=19623  KO=0     )
================================================================================


================================================================================
2016-12-26 09:37:41                                          50s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=21814  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=21814  KO=0     )
================================================================================


================================================================================
2016-12-26 09:37:46                                          55s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=24114  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=24114  KO=0     )
================================================================================


================================================================================
2016-12-26 09:37:51                                          60s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=26392  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=26392  KO=0     )
================================================================================


================================================================================
2016-12-26 09:37:56                                          65s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=28674  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=28674  KO=0     )
================================================================================


================================================================================
2016-12-26 09:38:01                                          70s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=30929  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=30929  KO=0     )
================================================================================


================================================================================
2016-12-26 09:38:06                                          75s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=33209  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=33209  KO=0     )
================================================================================


================================================================================
2016-12-26 09:38:11                                          80s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=35479  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=35479  KO=0     )
================================================================================


================================================================================
2016-12-26 09:38:16                                          85s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=37819  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=37819  KO=0     )
================================================================================


================================================================================
2016-12-26 09:38:21                                          90s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=40110  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=40110  KO=0     )
================================================================================


================================================================================
2016-12-26 09:38:26                                          95s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=42265  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=42265  KO=0     )
================================================================================


================================================================================
2016-12-26 09:38:31                                         100s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=44132  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=44132  KO=0     )
================================================================================


================================================================================
2016-12-26 09:38:36                                         105s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=46435  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=46435  KO=0     )
================================================================================


================================================================================
2016-12-26 09:38:41                                         110s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=48716  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=48716  KO=0     )
================================================================================


================================================================================
2016-12-26 09:38:46                                         115s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=50997  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=50997  KO=0     )
================================================================================


================================================================================
2016-12-26 09:38:51                                         120s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=53253  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=53253  KO=0     )
================================================================================


================================================================================
2016-12-26 09:38:54                                         122s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[##########################################################################]100%
          waiting: 0      / active: 0      / done:30    
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=53980  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=53980  KO=0     )
================================================================================

Simulation finished
Stored in influxdb the monitoring part ElasticSearch - Before call
Stored in influxdb the monitoring part ElasticSearch - Call
Stored in influxdb the monitoring part ElasticSearch - After call
Monitoring is stored in influxdb
Opening http://localhost:3000/dashboard/db/daas-hetzner-hdw?from=1482741411305&to=1482741536260
Opening http://localhost:3000/dashboard/db/daas-hetzner-monitoring
Parsing log file(s)...
Parsing log file(s) done
Generating reports...

================================================================================
---- Global Information --------------------------------------------------------
> request count                                      53980 (OK=53980  KO=0     )
> min response time                                     48 (OK=48     KO=-     )
> max response time                                    339 (OK=339    KO=-     )
> mean response time                                    65 (OK=65     KO=-     )
> std deviation                                         13 (OK=13     KO=-     )
> response time 50th percentile                         63 (OK=63     KO=-     )
> response time 75th percentile                         68 (OK=68     KO=-     )
> mean requests/sec                                439.122 (OK=439.122 KO=-     )
---- Response Time Distribution ------------------------------------------------
> t < 200 ms                                         53949 (100%)
> 200 ms < t < 800 ms                                   31 (  0%)
> t > 800 ms                                             0 (  0%)
> failed                                                 0 (  0%)
================================================================================

Reports generated in 6s.
Please open the following file: /home/david/workspace/daas/testPF/target/gatling/results/esloadtestpostsearchsimulation30x1m-1482741411776/index.html
[INFO] ------------------------------------------------------------------------
[INFO] BUILD SUCCESS
[INFO] ------------------------------------------------------------------------
[INFO] Total time: 04:34 min
[INFO] Finished at: 2016-12-26T09:39:35+01:00
[INFO] Final Memory: 18M/315M
[INFO] ------------------------------------------------------------------------